W7D2/music_app/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "FSZhWjS2JRc6rGOvxhnYxw"], ["updated_at", "2020-08-18 18:06:15.900719"], ["id", 1]]
---
    def reset_session_token
        self.session_token = self.class.generate_session_token
        self.save!